InformationRegisters/ПредпочтительныйТипЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПредпочтительныйТипЗанятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипПроведенияЗанятий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроведенияЗанятий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПредпочтительныйТипЗанятий/Ext/ManagerModule.bsl
Процедура ЗаписатьТипЗанятий(Обучающийся, ТипЗанятий) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.Обучающийся = Обучающийся;
	Запись.ТипПроведенияЗанятий	= ТипЗанятий;
	Запись.Записать();
	
КонецПроцедуры

Функция ПолучитьТипЗаниятй(Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПредпочтительныйТипЗанятийСрезПоследних.ТипПроведенияЗанятий
	                      |ИЗ
	                      |	РегистрСведений.ПредпочтительныйТипЗанятий.СрезПоследних КАК ПредпочтительныйТипЗанятийСрезПоследних
	                      |ГДЕ
	                      |	ПредпочтительныйТипЗанятийСрезПоследних.Обучающийся = &Обучающийся");
	
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ТипПроведенияЗанятий;
	Иначе
		Возврат Перечисления.ТипыПроведенияЗанятий.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
